In [15]:
import pandas as pd
import numpy as np

# Create a DataFrame from the following data: Names, and group numbers for the students of the course Introduction to Data Science (only practical part). [The data can be fetched from Neptun]. Then do the following:

df1 = pd.read_excel('../Datasets/export_2.xlsx', usecols=[0]).assign(group_number=2)
df2 = pd.read_excel('../Datasets/export (3).xlsx', usecols=[0]).assign(group_number=3)
df3 = pd.read_excel('../Datasets/export (4).xlsx', usecols=[0]).assign(group_number=4)
df4 = pd.read_excel('../Datasets/export (5).xlsx', usecols=[0]).assign(group_number=5)
df5 = pd.read_excel('../Datasets/export (6).xlsx', usecols=[0]).assign(group_number=6)
df6 = pd.read_excel('../Datasets/export (7).xlsx', usecols=[0]).assign(group_number=7)

#print(f'{i}')
#df2 = pd.read_excel('')

df_new = pd.concat([df1, df2, df3, df4, df5, df6]).reset_index(drop=True)

# 1. Assign a random mark (between 1 and 5) to each student in a new column called 'mark'.

df_new['mark'] = np.random.random_integers(1, 5, len(df_new))

# 2. Give every student a unique ID number (starting from 1) in a new column called 'ID'.
df_new['ID'] = df_new.index.array

/tmp/ipykernel_12508/3421590262.py:20: DeprecationWarning: This function is deprecated. Please call randint(1, 5 + 1) instead
  df_new['mark'] = np.random.random_integers(1, 5, len(df_new))

In [16]:
df_new

                    Name  group_number  mark   ID
0             Ákos Rúzsa             2     1    0
1    Aleksandr Soshnikov             2     2    1
2             Andor Kiss             2     3    2
3            Bence Korpa             2     2    3
4          Fareed Naouri             2     4    4
..                   ...           ...   ...  ...
139         Ulvi Ahmadli             7     4  139
140         Waleed Saleh             7     1  140
141             Zihan Li             7     3  141
142          Zsolt Csibi             7     5  142
143       Zuzanna Chudek             7     1  143

[144 rows x 4 columns]

In [21]:
cols = df_new.columns.tolist()
cols = [cols[-1]] + cols[:-1]
cols

['ID', 'Name', 'group_number', 'mark']

In [22]:
df_new = df_new[cols]
df_new

      ID                 Name  group_number  mark
0      0           Ákos Rúzsa             2     1
1      1  Aleksandr Soshnikov             2     2
2      2           Andor Kiss             2     3
3      3          Bence Korpa             2     2
4      4        Fareed Naouri             2     4
..   ...                  ...           ...   ...
139  139         Ulvi Ahmadli             7     4
140  140         Waleed Saleh             7     1
141  141             Zihan Li             7     3
142  142          Zsolt Csibi             7     5
143  143       Zuzanna Chudek             7     1

[144 rows x 4 columns]

In [24]:
# 3. Calculate the average mark of the students
avg_mark = df_new['mark'].mean()
avg_mark

2.8958333333333335

In [ ]:
# 4. Calculate the average mark of the students in each group
for i in range(df_new.group_number):
    df_new.loc[i]